Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ལ་གནས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གནས་པ་དེ་ནི་འདི་སྙམ་དུ་བདག་ནི་ཕྱིར་ལྡོག་པའམ་ཕྱིར་མི་ལྡོག་པ་མ་ཡིན་ནོ་སྙམ་ཡང་མི་བྱེད་དེ།
en: Moreover, Subhūti, irreversible great bodhisattva beings who have practiced the perfection of wisdom, who dwell in the emptiness of internal phenomena, and who dwell in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; who dwell in the applications of mindfulness and dwell in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; who dwell in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; who dwell in the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; and who dwell in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas do not wonder whether they are irreversible or reversible.

source: ཐེ་ཚོམ་མི་སྐྱེ་ཞིང་རང་གི་ས་ལ་ཡིད་གཉིས་མེད་དོ།
en: They do not hesitate, and they are without doubt regarding their own level.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་ཕྱིར་ལྡོག་པ་དང་། ཕྱིར་ལྡོག་པ་མ་ཡིན་པའི་ཆོས་རྡུལ་ཙམ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱུན་དུ་ཞུགས་པའི་སྐྱེས་བུ་རྒྱུན་དུ་ཞུགས་པའི་ས་ལ་གནས་པ་ནི། རང་གི་ས་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟའོ། །ལན་ཅིག་ཕྱིར་འོང་བ་ལན་ཅིག་ཕྱིར་འོང་བའི་ས་ལ་གནས་པ་དང་། ཕྱིར་མི་འོང་བ་ཕྱིར་མི་འོང་བའི་ས་ལ་གནས་པ་དང་། དགྲ་བཅོམ་པ་དགྲ་བཅོམ་པའི་ས་ལ་གནས་པ་ནི།
en: If you ask why, it is because they do not observe anything at all that is reversible or irreversible, even to the extent of the tiniest particle. “

source: རང་གི་ས་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟའོ། །རང་སངས་རྒྱས་རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པ་ནི། རང་གི་ས་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟའོ། །བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་གནས་པ་ནི། རང་གི་ས་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟའོ།
en: Subhūti, just as persons entering the stream to nirvāṇa and abiding on the level of one who has entered the stream to nirvāṇa have no doubt and no hesitation regarding their own level; just as those abiding on the level of one who is destined for only one more rebirth, abiding on the level of one who is no longer subject to rebirth, and abiding on the level of arhatship have no doubt and no hesitation regarding their own level; just as pratyekabuddhas abiding on the level of the pratyekabuddhas have no doubt and no hesitation regarding their own level; just as bodhisattvas abiding on the level of the bodhisattvas have no doubt and no hesitation regarding their own level; and just as completely awakened buddhas abiding on the level of the completely awakened buddhas have no doubt and no hesitation regarding their own level, in the same way, Subhūti, these bodhisattva great beings too have no doubt and no hesitation regarding their own level. {

source: །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པ་ནི། རང་གི་ས་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟའོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རང་གི་ས་ལ་གནས་པ་ཡང་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟ་ཞིང་།
en: Ki.

source: དེ་ཕྱིར་མི་ལྡོག་པའི་ས་དེ་ལ་གནས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་སྦྱོང་ངོ་། །སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: IV: 160} Therefore, abiding on that level at which progress has become irreversible, they also refine the buddhafields and they bring beings to maturity.

source: །བདུད་ཀྱི་ལས་སྐྱེས་ཤིང་བྱུང་བ་དག་ཀྱང་ཤེས་ཏེ། བདུད་ཀྱི་ལས་ཀྱི་དབང་དུ་ཡང་མི་འགྲོ། །བདུད་ཀྱི་ལས་དེ་དག་ཐམས་ཅད་ཀྱང་རྣམ་པར་འཇོམས་ཞིང་སྲབ་མོར་བྱེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Knowing, too, the deeds of Māra that have arisen and occurred, they do not fall under the influence of Māra’s deeds. Rather, they overwhelm and wear them down. “

source: མཚམས་མེད་པ་བྱེད་བྱེད་པའི་སྐྱེས་བུ་ནི་འཆི་ཀའི་བར་དུ་ཡང་མཚམས་མེད་པའི་སེམས་དང་མི་འབྲལ་ཞིང་། མཚམས་མེད་པའི་སེམས་དེ་རྗེས་སུ་འབྲང་ངོ་། །མཚམས་མེད་པའི་སེམས་དེ་ཐབས་མཁས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་རྣམ་པར་གཞིལ་བར་མི་ནུས་ཏེ། ཀུན་ནས་ལྡང་བ་དེ་འཆི་ཀའི་བར་དུ་ཡང་རྗེས་སུ་འབྲང་ངོ་། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིར་མི་ལྡོག་པའི་སེམས་ཀྱང་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པ་སྟེ།
en: Subhūti, just as a man who has committed an inexpiable crime will never be separated from the thoughts associated with that inexpiable crime, even until death, and the thoughts of that inexpiable crime will pursue him, such that he cannot banish the thoughts of that inexpiable crime by any means whatsoever, and his obsessive thoughts will pursue him even until death, in the same way, Subhūti, the irreversible thoughts of irreversible bodhisattva great beings are indeed established on the level at which progress has become irreversible.

source: སེམས་དེ་རྣམ་པར་བརྟག་ཏུ་མེད་ཅིང་མི་སྐུལ་བས།
en: Those thoughts do not vacillate and do not waver.

source: དེ་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱིར་བཟློག་པར་མི་ནུས་སོ།
en: The world with its gods, humans, and asuras cannot turn them back.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་སེམས་དེས་ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ལས་འདས་ཏེ།
en: If you ask why, it is because their thoughts have transcended the world with its gods, humans, and asuras, and entered into authentic maturity.

source: ཡང་དག་པའི་སྐྱོན་མེད་པར་ཞུགས་པས་དེ་རང་གི་ས་ལ་གནས་ཤིང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་ཕ་རོལ་དུ་ཕྱིན་པའི་མཆོག་ཐོབ་པས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: Abiding on their own level, they have reached supreme perfection in the extrasensory powers, and so they refine the buddhafields and also bring beings to maturity.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བལྟ་བ་དང་། དེ་དག་ལ་ཕྱག་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ཡང་འགྲོའོ།
en: They travel from buddhafield to buddhafield in order to behold, pay homage to, and listen to the Dharma from the lord buddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་དགེ་བའི་རྩ་བ་མང་པོ་ཡང་བསྐྱེད་ཅིང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཀུན་འདྲི་ཞིང་ཡོངས་སུ་ཞུ་བ་བྱེད། བསྙེན་བཀུར་བྱེད་དོ།
en: Throughout those buddhafields they cultivate the roots of virtue in the presence of the lord buddhas, and they question, counter-question, and venerate those lord buddhas. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དེ་ལྟར་གནས་བས་བདུད་ཀྱི་ལས་སྐྱེས་ཤིང་བྱུང་བ་རྣམས་ཁོང་དུ་ཆུད་དེ།
en: Subhūti, since those bodhisattva great beings dwell in that manner, they comprehend the deeds of Māra that have arisen and occurred.

source: བདུད་ཀྱི་ལས་སྐྱེས་ཤིང་བྱུང་བ་དག་གི་དབང་དུའང་མི་འགྲོའོ།
en: They do not go forth under the influence of those deeds of Māra that have arisen and occurred.

source: །བདུད་ཀྱི་ལས་དེ་དག་ཀྱང་ཐབས་མཁས་པས་ཡང་དག་པའི་མཐའ་ལ་སྦྱོར་བར་བྱེད་ཅིང་དེ་རང་གི་ས་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟའོ།
en: They can even integrate those deeds of Māra in the very limit of reality through their skill in means. They never have doubt, indecision, or hesitation regarding their own level.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ཡང་དག་པའི་མཐའ་ལ་ནེམ་ནུར་མེད་པས། ཡང་དག་པའི་མཐའ་གཅིག་གམ། གཉིས་སུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: If you ask why, Subhūti, it is because they have no doubt regarding the very limit of reality, and so they do not consider the very limit of reality as singular or dual.

source: དེ་ལྟར་ཤེས་པས་དེ་ཚེ་འཕོས་ནས་ཀྱང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སར་སེམས་མི་སྐྱེའོ།
en: Knowing this, even after they have passed away, they will not generate thoughts on the levels of the śrāvakas or the pratyekabuddhas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་བ་ལ། ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པའམ། ཀུན་ནས་ཉོན་མོངས་པའམ།
en: If you ask why, Subhūti, it is because bodhisattva great beings, with regard to all phenomena, which are empty of intrinsic defining characteristics, do not observe anything at all that is subject to arising, cessation, affliction, or purification. “

source: རྣམ་པར་བྱང་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཚེ་འཕོས་ནས་ཀྱང་འདི་སྙམ་དུ་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་རོ་སྙམ་དུ་མི་བྱེད་དེ།
en: Subhūti, when those bodhisattva great beings have passed away, they will not think, ‘I will not attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་སྙམ་སེམས་སོ།
en: Certainly they will think, ‘I shall attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: If you ask why, Subhūti, it is because unsurpassed, complete enlightenment is empty of intrinsic defining characteristics. {

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རང་གི་ས་ལ་དེ་ལྟར་གནས་པ་ནི་རང་གི་ས་ལ་ཐུབ་པ་མེད་པ་ཡིན་ཏེ།
en: Ki.IV: 161} “Subhūti, bodhisattva great beings who dwell in that manner on their own level cannot be overcome on their own level.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་གནས་པ་ནི་མི་འཕྲོགས་པའི་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན་ཏེ།
en: If you ask why, Subhūti, it is because irreversible bodhisattva great beings who dwell accordingly are endowed with wisdom that cannot be captivated.

source: རབ་འབྱོར་གལ་ཏེ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་བདུད་སྡིག་ཏོ་ཅན་སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་ཉེ་བར་འོངས་ནས། འདི་སྐད་དུ་ཁྱོད་ཀྱིས་འདི་ཉིད་དུ་དགྲ་བཅོམ་པ་ཐོབ་པར་གྱིས་ཤིག །
en: Subhūti, if the evil Māra were to approach irreversible bodhisattva great beings in the guise of the buddhas, he might say, ‘In this [lifetime], you should attain arhatship!

source: ཁྱོད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ཏོ།
en: You are not prophesied to attain unsurpassed, complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་གང་གིས་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་བའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཁྱོད་ཀྱིས་མ་ཐོབ་བོ།
en: You have not acquired the acceptance that phenomena are nonarising, whereby the tathāgatas, arhats, completely awakened buddhas would prophesy that you will attain unsurpassed, complete enlightenment.

source: །རྣམ་པ་གང་དག་དང་ཚུལ་གང་དག་དང་མཚན་མ་གང་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པའི་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་ཀྱང་ཁྱོད་ལ་མེད་དོ་ཞེས་ཟེར་ཡང་།
en: You do not possess the attributes, the indications, or the signs endowed with which bodhisattva great beings are prophesied to attain unsurpassed, complete enlightenment!’ “

source: རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྒྲ་དེ་ཐོས་ནས་མི་འཇུམ་མི་འགོད་ཞིང་། དེའི་སེམས་གཞན་དུ་མི་འགྱུར་ལ་ཡིད་སྐྲག་པར་མི་འགྱུར་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: Subhūti, if, even on hearing these words, bodhisattva great beings are not discouraged, not intimidated, not alienated, and not terrified, then, Subhūti, these bodhisattva great beings are prophesied by the tathāgatas, arhats, completely awakened buddhas to attain unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་བའི་ཆོས་དེ་དག་བདག་ལ་ཡོད་དོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ།
en: If you ask why, it is because these bodhisattva great beings should know that they themselves possess the attributes endowed with which they are prophesied to attain unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་གལ་ཏེ་བདུད་སྡིག་ཏོ་ཅན་ནམ། བདུད་ཀྱི་བྱིན་གྱིས་བརླབས་པའི་སྐྱེས་བུ་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་ཉེ་བར་འོངས་ནས། ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ལུང་བསྟན་ཀྱང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་ཀྱི་སའམ།
en: Subhūti, even if the evil Māra, or someone under the influence of Māra, were to approach bodhisattva great beings in the guise of a buddha and prophesy that they will attain the level of the śrāvakas or the level of the pratyekabuddhas, these bodhisattva great beings would think, ‘The tathāgatas, arhats, completely awakened buddhas do not encourage bodhisattva great beings to attain the level of the śrāvakas or the level of the pratyekabuddhas.

source: རང་སངས་རྒྱས་ཀྱི་ས་ལ་ཡང་ཡང་དག་པར་བསྐུལ་བ་མི་མཛད་དེ།
en: Alas!

source: ཀྱེ་མ་འདི་ནི་བདུད་སྡིག་ཏོ་ཅན་ནམ། བདུད་སྡིག་ཏོ་ཅན་གྱིས་བྱིན་གྱིས་བརླབས་པའི་སྐྱེས་བུ་ཞིག །སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་ཉེ་བར་འོངས་སོ་སྙམ་སེམས་པ་དང་།
en: This is the evil Māra, or someone under the influence of the evil Māra, who has approached me in the guise of a buddha!’

source: གལ་ཏེ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་དུ་རྒྱས་པའི་མདོ་སྡེ་ཀློག་པ་དང་ཁ་ཏོན་བྱེད་པ་ལ་བདུད་སྡིག་ཏོ་ཅན་སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་ཉེ་བར་འོངས་ནས། དེ་ལ་འདི་སྐད་དུ་གང་ལ་ཁྱོད་སྤྱོད་པའི་མདོ་སྡེ་འདི་དག་ནི་བདུད་ཀྱིས་བཤད་པ་ཡིན་ཏེ།
en: And, Subhūti, if the evil Māra were to approach bodhisattva great beings in the guise of a buddha while they are reciting and disseminating the most extensive sūtras and say, ‘Those sūtras that you are practicing have been taught by Māra.

source: འདི་དག་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ས་བཤད་པ་མ་ཡིན་ནོ་ཞེས་ཟེར་ན།
en: They have not been taught by the lord buddhas, the śrāvakas, or the pratyekabuddhas!’

source: རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས།
en: then when this was said, Subhūti, these bodhisattva great beings would know, ‘Alas!

source: ཀྱེ་མ་གང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་འབྲལ་བར་བྱེད་པ་འདི་ནི་བདུད་སྡིག་ཏོ་ཅན་ནམ། བདུད་ཀྱི་བྱིན་གྱིས་བརླབས་པའི་སྐྱེས་བུའོ་ཞེས་བྱ་བར་རིག་པར་བྱེད་ན།
en: This is the evil Māra, or someone under the influence of Māra, who would separate me from unsurpassed, complete enlightenment!’

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡིན་ཏེ།
en: If this is so, Subhūti, these bodhisattva great beings have been prophesied by the tathāgatas, arhats, completely awakened buddhas of the past to attain unsurpassed, complete enlightenment. {

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་རིག་པར་བྱའོ།
en: Ki.IV: 162} Those bodhisattva great beings should know that they dwell on the level at which progress has become irreversible.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་ནི་དེ་ལ་ཡོད་དོ།
en: If you ask why, it is because they possess the attributes, indications, and signs of irreversible bodhisattva great beings.

source: །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess those attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བདག་ཀྱང་ཡོངས་སུ་གཏོང་ལ། སྲོག་ཡོངས་སུ་ཆད་པར་འགྱུར་ཡང་སྡོད་ཅིང་ཆོས་དེ་ཡོངས་སུ་མི་གཏོང་ངོ་།
en: Moreover, Subhūti, when irreversible bodhisattva great beings practice the perfection of wisdom, they will relinquish even themselves, and they will sacrifice their own lives, for the sake of acquiring the Dharma, but they do not relinquish the doctrine.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་འདི་ལྟར་བརྩོན་པར་བྱེད་དེ།
en: Subhūti, those bodhisattva great beings persevere in that manner in order to acquire the Dharma.

source: འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་ཞིང་། དམ་པའི་ཆོས་ཡོངས་སུ་མི་གཏོང་བ་དེ་ལྟར་བརྩོན་པར་བྱེད་དོ།
en: They persevere in that manner so as to acquire the Dharma of the lord buddhas of the past, the future, and the present, and they do not relinquish the Dharma.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་འདི་སྙམ་དུ་སེམས་ཏེ། དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་ན། འདས་པ་དང་མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པར་འགྱུར།
en: If you ask why, it is because they think, ‘I will worship the lord buddhas of the past, the future, and the present, since they have acquired the Dharma.

source: དེ་དག་གི་དམ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ་སྙམ་མོ།
en: I also will acquire their Dharma.’

source: །དེ་ལ་ཆོས་གང་གི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདག་ཡོངས་སུ་གཏོང་ཞིང་སྲོག་ཡོངས་སུ་ཆད་པར་འགྱུར་ཡང་སྡོད་པའི་ཆོས་དེ་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་སྟོང་ངོ་ཞེས་ཆོས་སྟོན་ཏེ།
en: If you ask for the sake of which doctrine bodhisattva great beings relinquish themselves and sacrifice their lives, in this regard, Subhūti, the tathāgatas, arhats, completely awakened buddhas teach the doctrine that all phenomena are empty.

source: དེ་ལ་སྐྱེས་བུ་བླུན་པོ་ལ་ལ་འདི་ནི་ཆོས་མ་ཡིན།
en: Some foolish persons may contradict this and repudiate it, saying, ‘This is not the Dharma.

source: འདི་ནི་འདུལ་བ་མ་ཡིན་འདི་ནི་སྟོན་པས་བསྟན་པ་མ་ཡིན་ནོ་ཞེས་ཕྱིར་རྒོལ་ཞིང་ངན་དུ་བརྗོད་དེ།
en: This is not the Vinaya. This is not the taught by the Teacher.’

source: རབ་འབྱོར་ཆོས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདག་ཡོངས་སུ་གཏོང་ཞིང་སྲོག་ཡོངས་སུ་ཆད་པར་འགྱུར་ཡང་མི་གཏོང་ངོ་།
en: However, Subhūti, even though bodhisattva great beings will relinquish themselves and sacrifice their lives for the sake of this Dharma, they will not relinquish that.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ། གང་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་འབྱུང་བར་འགྱུར་བ་དེ་དག་གི་ནང་དུ་བདག་ཀྱང་གྲངས་སུ་གཞུག་གོ །
en: Subhūti, bodhisattva great beings should train in this manner, thinking, ‘I too will be reckoned among the tathāgatas who will emerge in the future.

source: བདག་ཀྱང་དེར་ལུང་བསྟན་ཏོ།
en: I too will be prophesied to attain that.

source: །ཆོས་གང་གི་ཕྱིར་བདག་ཡོངས་སུ་གཏོང་བ་དང་།
en: For the sake of this doctrine, I will relinquish myself!

source: སྲོག་ཡོངས་སུ་ཆད་པར་འགྱུར་ཡང་མི་གཏོང་བ་དེ་ཡང་བདག་གིས་ཆོས་སོ་ཞེས་བསླབ་བོ།
en: I will even sacrifice my life, but that which I will not relinquish is the doctrine!’

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དོན་གྱི་དབང་འདི་མཐོང་བས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བདག་ཀྱང་ཡོངས་སུ་གཏོང་ལ་སྲོག་ཡོངས་སུ་ཆད་པར་འགྱུར་ཡང་སྡོད་པ་ཡིན་ནོ། །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་།
en: Subhūti, bodhisattva great beings, considering this objective, will relinquish even themselves and sacrifice their lives for the sake of acquiring the Dharma.

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་སྟོན་པ་ལ་ནེམ་ནུར་མེད།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible do not harbor doubt or hesitation when the tathāgatas, arhats, completely awakened buddhas are teaching the Dharma. They do not have even a single moment of indecision with regard to that doctrine.

source: ཐེ་ཚོམ་མི་ཟ་ཞིང་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གསུངས་པ་དེ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཏོ། །དེ་ལྟར་བཟུང་ནས་ཀྱང་ཆུད་ཟ་བར་མི་བྱེད་དོ།
en: They grasp all those teachings of the lord buddhas, and having grasped them, they do not squander them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གཟུངས་རབ་ཏུ་ཐོབ་པའི་ཕྱིར་རོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: If you ask why, it is because they have acquired the dhāraṇīs that enhance retention.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གཟུངས་གང་ཐོབ་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་རྣམས་ཆབ་མི་འཚལ་བ་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, by acquiring which dhāraṇīs do bodhisattva great beings not squander the sūtras spoken by the Tathāgata?” {

source: རབ་འབྱོར་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་རབ་ཏུ་ཐོབ་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་རྣམས་ཆུད་མི་ཟའོ།
en: IV: 163} “Subhūti,” replied the Blessed One, “by acquiring the dhāraṇī of the inexhaustible cornucopia, bodhisattva great beings will not squander the sūtras spoken by the Tathāgata.

source: །དེ་བཞིན་དུ་རྒྱ་མཚོའི་ཕྱག་རྒྱ་དང་། པད་མོ་རྣམ་པར་བཀོད་པ་དང་། ཡོངས་སུ་འཛིན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་རྣམས་ཆུད་མི་ཟའོ།
en: By acquiring the oceanic seal [absorbing all phenomena], the dhāraṇī of the lotus array, and the dhāraṇī of acquisition, bodhisattva great beings will not squander the sūtras spoken by the Tathāgata.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གསུངས་པ་འབའ་ཞིག་ཆབ་མི་འཚལ་དུ་བས་ཀྱི་ཉན་ཐོས་ཀྱིས་བཤད་པ་མ་ལགས་སམ། ལྷས་བཤད་པ་མ་ལགས་སམ། ཀླུས་བཤད་པ་མ་ལགས་སམ།
en: Blessed Lord, it is the case that one should not squander [the sūtras] spoken only by the tathāgatas, arhats, completely awakened buddhas.

source: གནོད་སྦྱིན་གྱིས་བཤད་པ་མ་ལགས་སམ། དྲི་ཟས་བཤད་པ་མ་ལགས་སམ། ལྷ་མ་ཡིན་གྱིས་བཤད་པ་མ་ལགས་སམ། ནམ་མཁའ་ལྡིང་གིས་བཤད་པ་མ་ལགས་སམ། ལྟོ་འཕྱེ་ཆེན་པོས་བཤད་པ་མ་ལགས་སམ།
en: But does this not also refer to those that are explained by the śrāvakas, does it not refer to those explained by the gods, does it not refer to those explained by the nāgas, does it not refer to those explained by the yakṣas, does it not refer to those explained by the gandharvas, does it not refer to those explained by the asuras, does it not refer to those explained by garuḍas, and does it not refer to those explained by mahoragas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྐད་དང་། བརྡ་དང་། སྒྲ་གང་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཚོམ་མེད་དོ།
en: Subhūti,” replied the Blessed One, “these bodhisattva great beings have no doubt and no hesitation regarding all languages, symbols, and sounds.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་དེས་གཟུངས་རབ་ཏུ་ཐོབ་པའི་ཕྱིར་རོ།
en: If you ask why, it is because they have acquired the dhāraṇīs that enhance retention.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ཕྱིར་མི་ལྡོག་པའི་ལེའུ་སྟེ་བཞི་བཅུ་པའོ།། །།དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: This completes the fortieth chapter, “Irreversibility,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཡོན་ཏན་ཆེན་པོ་དང་ལྡན་པའོ།
en: Chapter 41 The venerable Subhūti said to the Blessed One, “Blessed Lord, irreversible bodhisattva great beings are endowed with great attributes.

source: །བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཚད་མ་མཆིས་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་པའི་ཡོན་ཏན་དང་ལྡན་པའོ།
en: Blessed Lord, irreversible bodhisattva great beings are endowed with incalculable and inestimable attributes.

source: །བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསྐྱོད་དུ་མ་མཆིས་པའི་ཡོན་ཏན་དང་ལྡན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, irreversible bodhisattva great beings are endowed with unshakeable attributes.” “

source: རབ་འབྱོར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཡོན་ཏན་ཆེན་པོ་དང་ལྡན་པའོ།
en: Subhūti, irreversible bodhisattva great beings are endowed with great attributes.
